Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: འདི་ལྟར་ཟླ་བ་དང་ཉི་མ་འདི་གཉིས་ཡོད་ན་སྣང་ཞིང་གསལ་ལ་ཉིན་མཚན་དང་། ཟླ་བ་ཕྱེད་དང་། དུས་ཚིགས་དང་། ལོ་རྣམས་ཤེས་པར་འགྱུར་རོ།
en: Whenever the moon and the sun are out, they shine brightly and beings are able to distinguish night and day, the fortnights, the seasons, and the years.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདུག་ན་ཡང་སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བ་ཡིན་ལ།
en: Venerable Pūrṇa, in the same way, bodhisattva great beings take care of beings when they are present.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ན་ཡང་སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བ་ཡིན་ནོ།
en: Moreover, as they awaken to unsurpassed and perfect buddhahood and pass into nirvāṇa, they continue to take care of beings.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དེ་ལྟར་ཆོས་རྒྱ་ཆེན་པོ་དང་ལྡན་པས་ན་ནམས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བར་མི་འགྱུར་བ་མ་ཡིན་ནོ།
en: Venerable Pūrṇa, since bodhisattva great beings possess such vast qualities, there is no time at all when they do not take care of beings. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན་དེད་དཔོན་གསེར་འབུམ་དག་གིས་ཉོ་འཚོང་བྱེད་ན། སེམས་ཅན་ཚད་མེད་དཔག་ཏུ་མེད་པ་དག་བདེ་བར་འགྱུར་ཏེ་དེས་ནོར་གྱི་ཕུང་པོ་བསྡུས་པ་ལ་དེ་དག་ཡོངས་སུ་སྤྱོད་དོ།
en: Venerable Pūrṇa, if a merchant were to make a profit worth hundreds of thousands of gold coins, he would secure the well-being of a limitless number of beings, who could then enjoy his amassed wealth.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདུག་གམ་སྡོད་ཀྱང་རུང་སྟེ། སེམས་ཅན་དུ་མ་བདེ་བར་འགྱུར་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དེ་ཉིད་ཀྱི་མཐུས་ཉན་ཐོས་རྣམས་བདེ་བར་འགྱུར་བ་ལྟ་ཅི་སྨོས།
en: Venerable Pūrṇa, likewise, if bodhisattva great beings secure the well-being of numerous beings even when they remain seated or stationary, then clearly they also secure the hearers’ well-being by the power of awakening to unsurpassed and perfect buddhahood and passing into nirvāṇa.

source: ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྤྱོད་པའི་ཚེའམ། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའམ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ན་ཡང་རུང་སྟེ་ནམས་ཀྱང་ཉེ་བར་འཚོ་བར་མི་འགྱུར་བ་མ་ཡིན་ནོ།
en: Therefore, Venerable Pūrṇa, whether they act, awaken, or pass into nirvāṇa, there is no time at all when bodhisattva great beings do not take care of others.

source: །གང་གི་ཚེ་བདག་ཀྱང་བདེ་ལ། སེམས་ཅན་གཞན་རྣམས་ཀྱང་བདེ་བར་བྱེད་པ་འདི་ནི་སྐྱེས་བུ་དམ་པའི་མཚན་ཉིད་དོ།
en: The characteristic of a holy being is to be well oneself while ensuring the well-being of others. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་ནི།
en: Venerable Pūrṇa, consider the analogy of a king from the ruling class who has been anointed.

source: འདུག་པའི་ཚེ་ཡང་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་བདེ་བར་བྱེད་ལ།
en: Such a king ensures the well-being of all brahmins and householders when he is alive.

source: ཤི་ན་ཡང་སྔོན་གྱི་གཟི་བྱིན་དྲག་པོ་དེས་ཡུལ་དེའི་ཕྱོགས་སུ་རྐུན་པོ་དང་། ཆོམ་པོ་རྣམས་ཀྱིས་གླགས་མི་རྙེད་དོ།
en: Even after he passes away, by means of his past magnificence, his realm remains free from harm by robbers and bandits.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདུག་ན་ཡང་སེམས་ཅན་རྣམས་བདེ་བར་འགྱུར་ལ།
en: Venerable Pūrṇa, likewise, when bodhisattva great beings are present, they ensure the well-being of others.

source: མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་ན་ཡང་སེམས་ཅན་དཔག་ཏུ་མེད་པ་དག་བདེ་བར་འགྱུར་ཞིང་།
en: Even when they awaken and pass into nirvāṇa, they continue to ensure the well-being of limitless others.

source: གང་དག་དེའི་ཚུལ་ཁྲིམས་དྲན་པར་བྱེད་པ་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་དྲན་པར་བྱེད་པའི་སེམས་ཅན་དེ་དག་ཀྱང་བདེ་བར་འགྱུར་ཏེ།
en: They ensure the well-being of anyone who recollects their discipline and recollects their absorption, insight, liberation, and vision of liberated wisdom.

source: སེམས་ཅན་དེ་དག་ལ་མི་དང་མི་མ་ཡིན་པའི་འཇིགས་པས་དོགས་པར་མི་བྱའོ།
en: No terror by any human or nonhuman being will frighten such beings.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་ལེགས་སོ་ལེགས་སོ།
en: Then the Blessed One said to Venerable Śāradvatīputra, “Śāradvatīputra, excellent, excellent!

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ཏེ།
en: Śāradvatīputra, that is how it is.

source: སེམས་ཅན་དེ་དག་ལ་འཇིགས་པ་གང་གིས་ཀྱང་དོགས་པར་མི་བྱ་སྟེ།
en: Such beings will not be frightened by any kind of terror.

source: གང་དག་དེ་བཞིན་གཤེགས་པ་ལ་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ལས་དྲན་པར་བྱེད་ན། དེ་དག་ལ་འཇིགས་པ་གང་གིས་ཀྱང་དོགས་པར་མི་བྱའོ།
en: Whoever recollects the discipline, absorption, insight, liberation, and vision of liberated wisdom of the Thus-Gone One will not be frightened by any terror whatsoever.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཆོས་རྒྱ་ཆེན་པོ་དང་ལྡན་པ་ནི་ངོ་མཚར་ལགས་སོ།
en: Venerable Śāradvatīputra said to the Blessed One, “Blessed One, it is wonderful that the Blessed Buddha possesses such vast qualities!

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་ཆོས་རྒྱ་ཆེན་པོ་དང་ལྡན་པར་བལྟའོ། །གསོལ་པ།
en: The Blessed One said, “Śāradvatīputra, the bodhisattvas should also be seen to possess vast qualities.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་རྒྱ་ཆེ་བ་གང་ལགས།
en: Śāradvatīputra said, “Blessed One, what are the vast qualities that the bodhisattva great beings possess?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་གང་ཡིན་པ་འདི་ཉིད་རྒྱ་ཆེ་བ་ཡིན་ནོ།
en: The Blessed One said, “Śāradvatīputra, arousing the mind set upon unsurpassed and perfect awakening—that is vast.

source: འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་ཉིད་སངས་རྒྱས་ཉིད་འདི་ནི་རྒྱ་ཆེ་བའི་གནས་ཡིན་པའི་ཕྱིར་རོ།
en: Because the state of a thus-gone one—the state of a buddha—is a vast state.”

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས། སྦྱིན་པའི་ཐབས་ལ་མཁས་པའི་ལེའུ་སྟེ། གཉིས་པའོ།། །།
en: This concludes the second chapter from “The Perfection of Generosity” entitled “The Skillful Means of Generosity.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་གང་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདི་ལྟར་སེམས་བསྐྱེད་པར་བྱ་སྟེ།
en: Venerable Śāradvatīputra then said to Venerable Pūrṇa Maitrāyaṇīputra, “Venerable Pūrṇa, in this regard, here is how bodhisattva great beings should arouse the mind of awakening.

source: གལ་ཏེ་བདག་ལ་སློང་བ་འགའ་ཞིག་འོངས་ན་ཕྱིས་སྦྱིན་ནོ་ཞེའམ། བདག་ལ་མེད་དོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་མི་བྱའོ།
en: If approached by a beggar, they should never think, ‘I will give later,’ or, ‘I don’t have enough to give.’

source: །བདག་ནི་སྦྱིན་མི་ཕོད་དོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་མི་བྱའོ།
en: They should also never feel, ‘I cannot bear to give that away.’

source: །གཞན་སྦྱིན་པ་བྱེད་པ་དག་ལ་ཡང་རྗེས་སུ་ཡི་རང་བར་བྱ། ཡང་དག་པར་འཛིན་དུ་གཞུག་པར་བྱ། ཡང་དག་པར་དགའ་བར་བྱའོ།
en: If others are generous, they should rejoice, encourage them, and be happy.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བར་བྱའོ།
en: Venerable Pūrṇa, bodhisattva great beings should dedicate the merit that comes from rejoicing toward the state of omniscience.

source: །བྱང་ཆུབ་སེམས་དཔས་ཇི་ལྟར་བྱས་ན་སེམས་ཅན་འདི་དག་སྦྱིན་པ་གཏོང་ཞིང་། བསོད་ནམས་དག་ཀྱང་བྱེད་པར་འགྱུར་སྙམ་པའི་རྗེས་སུ་ཡི་རང་བའི་དགེ་བའི་སེམས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པ་དེས་ནི། དེ་དག་གི་སྦྱིན་པ་དང་ལྡན་པའི་སེམས་ཟིལ་གྱིས་གནོན་ཏེ།
en: When bodhisattvas rejoice by thinking of how these beings have practiced generosity and created merit, they dedicate the merit of their virtuous mind state toward the state of omniscience.

source: སེམས་ཅན་དེ་དག་གི་བསོད་ནམས་མངོན་པར་འདུ་བྱེད་པ་དང་། དགེ་བའི་རྩ་བ་མངོན་པར་འདུ་བྱེད་པ་གང་ཡིན་པ་དེའི་སྦྱིན་པའི་སེམས་སྔ་མ་དེས་ནི་རྗེས་སུ་ཡི་རང་བའི་སེམས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པ་དེའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: By doing so their attitude surpasses the attitude of those who actually gave. Comparatively, the merit and roots of virtue created by those who initially were generous would not constitute even one percent of those created by the mind that rejoices and dedicates toward the state of omniscience.

source: གྲངས་དང་། ཆ་དང་། བགྲང་བ་དང་། དཔེ་དང་རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་ཅིང་།
en: In fact, no number, fraction, enumeration, analogy, or comparison would suffice.

source: བྱང་ཆུབ་སེམས་དཔས་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་གཅིག་བསྐྱེད་པས་ཟིལ་གྱིས་གནོན་ཏེ། འདི་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པའི་ཕྱིར་རོ།
en: They would be surpassed by a single moment of the mind of bodhisattvas who rejoice, because they have dedicated the merit toward unsurpassed and perfect awakening. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ན། ཐབས་ལ་མཁས་པར་བྱ་སྟེ། དེ་གང་དང་གང་སྦྱིན་པ་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོའོ།
en: Venerable Pūrṇa, moreover, when bodhisattva great beings practice the perfection of generosity, they should be skillful and dedicate any form of generosity toward the state of omniscience.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ཐབས་ལ་མཁས་པར་བྱའོ།
en: Venerable Pūrṇa, in this way bodhisattva great beings should be skilled in means.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མི་མཁས་པ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གནས་ཏེ། སྦྱིན་པ་སྦྱིན་ལ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བར་མི་བྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་མ་ཡིན་ནོ།
en: Even if bodhisattvas who are not skillful practice generosity for as many eons as there are grains of sand in the Ganges, they will not be upholding the perfection of generosity if they fail to dedicate the merit toward the state of omniscience. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་སྐབས་འགའ་དག་ཏུ་སྣོད་འཛམ་བུའི་གླིང་གི་ཚད་ཙམ་ཐོགས་པའི་སེམས་ཅན་དག་འོངས་ཏེ། འདིའི་ནང་དུ་བྱིན་ཅིག་ཅེ་ན། དེར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ངེས་པར་སྦྱིན་པར་བྱའི། མེད་དོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་མི་བྱའོ།
en: Venerable Pūrṇa, moreover, even if it should happen that they were approached by beings holding a vessel as large as the entire world and requesting that it be filled with gifts, bodhisattva great beings should definitely give, and never think, ‘I can’t!’

source: །སྣོད་འདི་དག་ནི་ཧ་ཅང་ཆེས་སོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་མི་བྱའོ།
en: They should also not think, ‘This vessel is just too big!’

source: །སྣོད་འདི་དག་ཇི་ལྟར་ཡང་དགང་བར་བྱ་སྙམ་དུ་སེམས་བསྐྱེད་པར་མི་བྱའོ།
en: Nor should they think, ‘How could I ever fill this vessel!’ You may then wonder how they should react.

source: །ཇི་ལྟར་སེམས་བསྐྱེད་པར་བྱ་ཞེ་ན་སྦྱིན་ནོ།
en: Well, they should think, ‘I can do that.

source: །སྣོད་འདི་དག་དགང་བར་སྤྲོ་བར་བྱའོ།
en: I am happy to fill this vessel!

source: །ཇི་ལྟར་སྣོད་འདི་དག་དགང་བར་བྱ་བ་དེ་ལྟ་དེ་ལྟར་འབད་དོ། །དེ་ལྟ་དེ་ལྟར་བཙལ་ལོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱའོ།
en: I will strive and try my best to fill this vessel!’

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟ་དེ་ལྟར་འབད་ཅིང་རྩོལ་ལ། བརྩོན་འགྲུས་རྩོམ་སྟེ། ཡོངས་སུ་གཏོང་ན། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ཡིན་ནོ།
en: If bodhisattva great beings strive and try their best in this way, being diligent and generous, they uphold the perfection of generosity.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Venerable Pūrṇa, this is how bodhisattva great beings should train in the perfection of generosity. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་ལ་སྙིང་བརྩེ་བས་སྦྱིན་པ་སྦྱིན་པར་བྱའོ།
en: Venerable Pūrṇa, moreover, bodhisattva great beings should practice generosity toward beings with feelings of love.

source: །བྱམས་པ་དང་སྙིང་རྗེ་ལ་གནས་པར་བྱ་སྟེ། སེམས་ཅན་རྣམས་ལ་སྦྱིན་པ་སྦྱིན་པར་བྱའོ།
en: They should be filled with love and compassion while practicing generosity toward others.

source: །སྦྱིན་པ་སྦྱིན་པ་ན། འདི་ལྟར་གང་འདི་ལས་བསོད་ནམས་མངོན་པར་འདུ་བྱེད་པ་དང་། དགེ་བ་མངོན་པར་འདུ་བྱེད་པ་གང་ཡིན་པའི་བསོད་ནམས་དང་། དགེ་བ་མངོན་པར་འདུ་བྱེད་པ་དེས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་ན་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གནས་པ་དེ་དག་ནི་ཕྱིར་མི་ལྡོག་པ་ཉིད་དུ་གྱུར་ཅིག །
en: When they practice generosity, they should do it with the thought, ‘May the merit and virtue created hereby cause all bodhisattvas who have newly entered this vehicle in all the limitless and endless worlds to become nonregressing!

source: ཕྱིར་མི་ལྡོག་པ་གང་དག་གནས་པ་དེ་དག་ནི་མྱུར་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་ཅེས་སེམས་བསྐྱེད་པར་བྱའོ།
en: And may all nonregressing bodhisattvas swiftly perfect the state of omniscience!’

source: །ཇི་ལྟ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགེ་བའི་རྩ་བ་དེ་དག་ཡོངས་སུ་གཏོང་བ་དེ་ལྟ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབོགས་པར་འགྱུར་རོ།
en: The more bodhisattva great beings are able to give away their roots of virtue, the more they will progress toward the state of omniscience. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན་གསེར་ནི་ཇི་ལྟ་ཇི་ལྟར་བསྲེགས་པ་དང་། བཞུ་བ་དང་།
en: Venerable Pūrṇa, think of gold: the more it is heated, smelted, melted, and refined, the more it shines.

source: བསྐོལ་བ་དང་། ཚོས་པར་བྱས་པ་དེ་ལྟ་དེ་ལྟར་ཤིན་ཏུ་གསལ་བར་འགྱུར་རོ། །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ཇི་ལྟ་ཇི་ལྟར་བསོད་ནམས་མངོན་པར་འདུ་བྱེད་པ་དང་། དགེ་བ་མངོན་པར་འདུ་བྱེད་པ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བ་དེ་ལྟ་དེ་ལྟར་དགེ་བའི་རྩ་བ་རྣམས་ཀྱིས་འབོགས་སོ།
en: Venerable Pūrṇa, in the same way, the more bodhisattva great beings dedicate the merit and virtue that they have created toward the state of omniscience, the more their roots of virtue will enable them to excel.

source: །ཇི་ལྟ་ཇི་ལྟར་དགེ་བའི་རྩ་བ་རྣམས་ཀྱིས་འབོགས་པ་དེ་ལྟ་དེ་ལྟར་སེམས་ཅན་རྣམས་ཀྱིས་བསྙེན་པའི་འོས་སུ་འགྱུར་ཞིང་། ཁ་དོག་དང་། འོད་དང་། གཟི་བརྗིད་ཀྱིས་ཀྱང་ཤིན་ཏུ་གཟི་ཆེ་བར་འགྱུར་རོ། །
en: The more they excel by means of their roots of virtue, the more worthy they will become as recipients of others’ service, and that much more will their splendor increase in terms of their luster, shine, and charisma. “

source: ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། བུད་མེད་མེ་ལོང་གི་བྱི་དོར་བྱེད་པ་ན་ཇི་ལྟ་ཇི་ལྟར་མེ་ལོང་བྱི་དོར་བྱེད་པ་དེ་ལྟ་དེ་ལྟར་ཤིན་ཏུ་འོད་གསལ་བར་འགྱུར་ལ།
en: Venerable Pūrṇa, when a woman polishes a mirror, the more she does so, the clearer the mirror becomes.

source: ཇི་ལྟ་ཇི་ལྟར་ཤིན་ཏུ་འོད་གསལ་བར་གྱུར་པ་དེ་ལྟ་དེ་ལྟར་བཞིན་གསལ་བར་རབ་ཏུ་སྣང་ངོ་།
en: And the clearer it becomes, the clearer its reflections are.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ཇི་ལྟ་ཇི་ལྟར་སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ཞིང་། དེ་ལས་གཞན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཡང་ཡོངས་སུ་གཏོང་སྟེ། གང་དག་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པ་དེ་དག་ནི་ཕྱིར་མི་ལྡོག་པ་ཉིད་དུ་གྱུར་ཅིག །ཕྱིར་མི་ལྡོག་པ་གང་དག་ཡིན་པ་དེ་དག་ནི་མྱུར་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་ཅེས་ཇི་ལྟ་ཇི་ལྟར་ཡོངས་སུ་གཏོང་ཞིང་སྦྱིན་པ་དེ་ལྟ་དེ་ལྟར་དགེ་བའི་རྩ་བ་ཤིན་ཏུ་རྒྱ་ཆེ་བར་འགྱུར་རོ།
en: Venerable Pūrṇa, likewise, the more bodhisattva great beings dedicate the mass of merit created through generosity toward the state of omniscience and practice generosity by offering it to other bodhisattvas—saying, ‘May it cause those bodhisattvas who have newly entered this vehicle to reach the state of nonregression and may all those who have reached the state of nonregression swiftly perfect the state of omniscience!’—the more their roots of virtue will increase.

source: །ཇི་ལྟ་ཇི་ལྟར་དགེ་བའི་རྩ་བ་ཤིན་ཏུ་རྒྱ་ཆེ་བར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་འགྱུར་ཏེ།
en: The more their roots of virtue increase, the closer they will be to the state of omniscience.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་ཡོངས་སུ་སྔོ་བ་ནི་ཐབས་ལ་མཁས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: You should understand that when bodhisattvas dedicate in this manner, they are being skilled in means. “

source: །ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་ཆུང་ངུ་བྱིན་ན་བསོད་ནམས་མང་པོ་སྐྱེད་པར་འགྱུར་ཞེ་ན། གལ་ཏེ་སྦྱིན་པ་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་ན། དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པ་ཆུང་ངུ་བྱིན་ལ་བསོད་ནམས་མང་པོ་སྐྱེད་དོ།
en: It is said that ‘when bodhisattva great beings make a small gift, the merit produced is great,’ meaning that if generosity is dedicated toward the state of omniscience, even a small gift given by bodhisattvas yields great merit.

source: །ཅི་སྟེ་སྦྱིན་པ་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བར་མི་བྱེད་ན། དེ་ལྟར་སྦྱིན་པ་མང་པོ་བྱིན་ལ། བསོད་ནམས་ཉུང་ངུ་སྐྱེད་པར་འགྱུར་རོ།
en: On the other hand, if the gift is not dedicated toward the state of omniscience, they may give extensively and yet the resulting merit would be insignificant.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གནས་ཏེ། བདེ་བར་སྦྱར་བའི་ཡོ་བྱད་མང་པོ་ཡོངས་སུ་གཏོང་ལ། སྦྱིན་པ་དེའང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྔོ་བར་བྱེད་ན། དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པ་མང་པོ་སྦྱིན་ཞིང་། བསོད་ནམས་མང་པོ་སྐྱེད་དོ།
en: Therefore, if bodhisattvas were to live for as many eons as there are grains of sand in the Ganges, all the while giving away a multitude of desirable objects and dedicating their generosity toward the state of omniscience, not only would the bodhisattva great beings’ gifts be extensive, they would also in turn yield great merit.

source: །དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པ་སྦྱིན་པ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱེད་པ་དང་མ་བྲལ་བར་བྱའོ།
en: As such, when bodhisattva great beings practice generosity, they should always keep their focus on the state of omniscience.

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱེད་པ་དང་མ་བྲལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བྱང་ཆུབ་དང་ཉེ་བ་ཡིན་ཏེ། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Any bodhisattva great beings who keep their focus on the state of omniscience are bodhisattvas who are close to awakening; soon they will awaken to unsurpassed and perfect buddhahood.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དམིགས་པར་བྱེད་པ་ནི་ཐབས་ལ་མཁས་པ་ཡིན་པར་རིག་པར་བྱ་བའི་ཕྱིར་རོ།
en: Because when bodhisattva great beings keep their focus on the state of omniscience, they are being skilled in means. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཐོག་མ་ཉིད་དུ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Venerable Pūrṇa, bodhisattva great beings should train in the perfection of generosity right from the start.

source: ཚེ་དང་ལྡན་པ་གང་པོ་གང་གི་ཕྱིར་དེས་འཁོར་བ་ཐོག་མ་མེད་པ་ནས་སེར་སྣ་བསྟེན་ཏེ།
en: Because, Venerable Pūrṇa, they have been accustomed to miserliness since time without beginning in saṃsāra.

source: དེ་སྦྱིན་པ་དེ་ཡོངས་སུ་གཏོང་ན། སེར་སྣ་རྒྱང་རིང་བར་བྱེད་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་བྱེད་དོ།
en: When they practice generosity, they distance themselves from miserliness and instead approach the state of omniscience.

source: །ཇི་ལྟ་ཇི་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་བྱེད་པ་དེ་ལྟ་དེ་ལྟར་ཉན་ཐོས་ཀྱིས་དང་། རང་སངས་རྒྱས་ཀྱིས་ལས་ལྡོག་པར་བྱེད་དོ།
en: The closer they come to the state of omniscience, the more they turn away from the levels of the hearers and the solitary buddhas.

source: །ཇི་ལྟ་ཇི་ལྟར་ཉན་ཐོས་ཀྱིས་དང་། རང་སངས་རྒྱས་ཀྱིས་ལས་ལྡོག་པ་དེ་ལྟ་དེ་ལྟར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་འགྱུར་རོ།
en: The more they turn away from the levels of the hearers and the solitary buddhas, the closer they will be to the state of omniscience. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། ཆར་འབབ་པའི་ཚེ་བླ་གབ་མེད་པར་བུམ་པ་བཞག་པ་དེར་རིམ་གྱིས་ཐིགས་པ་བབ་པས་གང་བར་གྱུར་ན་དང་པོར་ཐིགས་པ་བབ་པ་གང་ཡིན་པ་དང་།
en: Venerable Pūrṇa, as an analogy, if you place a jar outside in the rain, it will gradually be filled as the raindrops fall.

source: ཐ་མར་ཐིགས་པ་བབ་པ་གང་ཡིན་པ་ཉི་ཚེས་བུམ་པ་དེ་གང་བར་གྱུར་པ་མ་ཡིན་གྱིས།
en: The very first raindrop does not fill the jar, nor does the very last.

source: དེའི་བར་གྱི་ཆུའི་ཐིགས་པ་རྒྱུན་མི་ཆད་པར་རིམ་གྱིས་བབ་པའི་ཆུའི་ཐིགས་པ་རྣམས་ཀྱིས་བུམ་པ་དེ་གང་བ་ཡིན་ནོ།
en: Rather, it is the raindrops that fall steadily from beginning to end that gradually fill the jar.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དང་པོ་སེམས་བསྐྱེད་པས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པ་ཡང་མ་ཡིན། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པས་ཀྱང་མ་ཡིན་གྱི། དང་པོ་སེམས་བསྐྱེད་པ་གང་ཡིན་པ་དང་།
en: Venerable Pūrṇa, likewise, bodhisattva great beings do not attain the state of omniscience as soon as they first arouse the mind of awakening, nor do they attain this state as they take their place at the seat of awakening.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པའི་སེམས་བསྐྱེད་པ་ཕྱི་མ་དེའི་བར་གྱི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་ཀྱི་ཁྱད་པར་བསྐྱེད་པ།
en: Rather, they do so by means of all the individual mind states that are directed toward the state of omniscience, beginning with their first arousal of the mind of awakening and continuing until they finally take their place at the seat of awakening.

source: ཕན་པར་གྱུར་པ་བསགས་པ་གང་དག་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་རིམ་གྱིས་འབྲས་བུ་བསྐྱེད་པ་ཡིན་ནོ།
en: It is through the accumulation of all of those beneficial mind states that they gradually produce the result of unsurpassed and perfect awakening.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དེ་ལྟར་ན་འདིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་མ་འདྲེས་པའི་སེམས་ཀྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དམིགས་པར་བྱའོ།
en: Venerable Pūrṇa, in this way, bodhisattva great beings should aim for the state of omniscience by means of a focused state of mind.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཇི་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་མ་འདྲེས་པ་ཡིན།
en: Venerable Pūrṇa Maitrāyaṇīputra said to Venerable Śāradvatīputra, “Venerable Śāradvatīputra, how is that state of mind of the bodhisattvas focused?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་བྱུང་ན། དེ་འང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཕན་པར་གྱུར་པར་མཐོང་ཞིང་། གལ་ཏེ་འདི་དག་ལས་བདག་གི་ལུས་གྲུབ་པས་ན་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་འདི་ནི་བདག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ཡིན་ཏེ།
en: Venerable Śāradvatīputra replied, “Venerable Pūrṇa, even when improper thoughts occur to bodhisattvas, they should perceive those thoughts as advantageous for the state of omniscience, thinking, ‘Since such improper thoughts have created my body, they have indeed been helpful for my practice of the perfections.’

source: སྐྱེད་པར་འགྱུར་བའོ་ཞེས་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་སེམས་མ་འདྲེས་པ་ཞེས་བྱའོ།
en: That is what is called a focused state of mind. “

source: །ཚེ་དང་ལྡན་པ་གང་པོ་གཞན་ཡང་གང་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ཕན་འདོགས་པ་དང་། གནོད་པ་བྱེད་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྒྱུ་ཡིན་པར་མཐོང་སྟེ།
en: Venerable Pūrṇa, moreover, anyone, regardless of whether they help or harm bodhisattva great beings, should be perceived as a cause for omniscience.

source: དེ་ལྟར་ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་མ་འདྲེས་པར་བྱའོ།
en: In this way, Venerable Pūrṇa, bodhisattva great beings should keep their minds focused.

source: །ཚེ་དང་ལྡན་པ་གང་པོ་དཔེར་ན། གསད་པར་ཆད་པའི་མི་གསད་པའི་སར་ཁྲིད་པ་ན་བདག་ནི་གསོད་དོ་སྙམ་པའི་ཡིད་ལ་བྱེད་པ་འབའ་ཞིག་འབྱུང་བར་འགྱུར་ཏེ།
en: Venerable Pūrṇa, as an analogy, when a man who is sentenced to death is being led to the place of execution, he only has the thought of his death in mind.

source: དཔེ་དེ་དང་འདྲ་བར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འབའ་ཞིག་ཡིད་ལ་བྱེད་པ་འདི་ནི།
en: Just like this analogy, bodhisattva great beings are only concerned with the state of omniscience.

source: ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་མ་འདྲེས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Venerable Pūrṇa, you should understand that such is the focused state of mind of bodhisattva great beings. “
